In [1]:
myfood = ['banana', 'apple', 'candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])
print(myfood[1:3])  # 첫번째 두번째 가져오기

banana
apple
candy
['apple', 'candy']

In [2]:
for item in myfood:
  print(item)

banana
apple
candy

In [6]:
dict1 = {'one':'하나', 'two':"둘", 'three':'셋'}
dict2 = {1:"하나", 2:"둘", 3:"셋"}
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}
print(dict1["three"])
print(dict2[2])
print(dict3['col2'])

셋
둘
['a', 'b', 'c']

In [7]:
import pandas as pd
import seaborn as sns
from pandas import Series, DataFrame

In [8]:
score = Series( [1000, 14000, 3000, 3000, 1000] )  
print(score) 
print("자료형 확인 : ", type(score))

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64
자료형 확인 :  <class 'pandas.core.series.Series'>

In [9]:
## Series 인덱스 확인
print(score.index) 
# 인덱스를 리스트 자료형으로 변경 후, 확인하기
print(list(score.index))   
## Series 값 확인
print(score.values) 
## Series 값 자료형 확인
print(score.dtype)

RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000  3000  1000]
int64

In [12]:
score

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64

In [13]:
### 인덱스(index) 속성 이용 
score = Series( [1000, 14000, 3000], 
               index = ['2019-05-01', '2019-05-02', '2019-05-03'] )  
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [14]:
score

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [15]:
my_food = Series(['스테이크','돈가스','냉면','보쌈','파스타'], index=['mon','tue','wed','tur','fri'])
my_food

mon    스테이크
tue     돈가스
wed      냉면
tur      보쌈
fri     파스타
dtype: object

In [16]:
for i in my_food.index:
    print(i)

mon
tue
wed
tur
fri

In [17]:
print(my_food['mon'])

스테이크

In [19]:
print(my_food['mon':'tur'])

mon    스테이크
tue     돈가스
wed      냉면
tur      보쌈
dtype: object

In [20]:
print(my_food[0:4])

mon    스테이크
tue     돈가스
wed      냉면
tur      보쌈
dtype: object

In [23]:
my_food.iloc[2]

'냉면'

In [26]:
my_food.loc['tur']

'보쌈'

In [27]:
my_food.values

array(['스테이크', '돈가스', '냉면', '보쌈', '파스타'], dtype=object)

In [28]:
my_food.index

Index(['mon', 'tue', 'wed', 'tur', 'fri'], dtype='object')

In [43]:
dat = { 'col1' : [1,2,3,4],
        'col2' : [10,20,30,40],
        'col3' : ['A', 'B', 'C', 'D'] }
df = DataFrame(dat, index=idx)
df

            col1  col2 col3
2021-06-21     1    10    A
2021-06-22     2    20    B
2021-06-23     3    30    C
2021-06-24     4    40    D

In [42]:
idx = pd.date_range(start="2021-06-21", end="2021-06-24")
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24'], dtype='datetime64[ns]', freq='D')

In [38]:
idx = pd.date_range(start="2021-06-21", end="2021-06-25")
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

In [48]:
from pandas import DataFrame
team_score = { "toto":[1500,3000,5000,7000,5500],
              "apple":[4000,5000,6000,5500,4500],
              "gildong":[2000,2500,3000,4000,3000],
              "catanddog":[7000,5000,3000,5000,4000]}
team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [51]:
date = ['19-05-01','19-05-02', '19-05-03', '19-05-04', '19-05-05']
team_df = DataFrame(team_score,
                   columns=['catanddog', 'toto', 'apple', 'gildong'],
                   index=date)
team_df

          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
19-05-04       5000  7000   5500     4000
19-05-05       4000  5500   4500     3000

In [52]:
team_df['toto']

19-05-01    1500
19-05-02    3000
19-05-03    5000
19-05-04    7000
19-05-05    5500
Name: toto, dtype: int64

In [53]:
team_df[['toto','gildong']]

          toto  gildong
19-05-01  1500     2000
19-05-02  3000     2500
19-05-03  5000     3000
19-05-04  7000     4000
19-05-05  5500     3000

In [54]:
print(team_df.loc['19-05-02'])

catanddog    5000
toto         3000
apple        5000
gildong      2500
Name: 19-05-02, dtype: int64

In [55]:
print(team_df.loc[ '19-05-02' ] ) # 19-05-02 일
print("-----------")
print(team_df.loc[ ['19-05-02', '19-05-03'] ]) # 5월 2일, 3일
print("-----------")
print(team_df.loc[ '19-05-02': ]) # 5월 2일 이후 전체 데이터 가져오기

catanddog    5000
toto         3000
apple        5000
gildong      2500
Name: 19-05-02, dtype: int64
-----------
          catanddog  toto  apple  gildong
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
-----------
          catanddog  toto  apple  gildong
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
19-05-04       5000  7000   5500     4000
19-05-05       4000  5500   4500     3000

In [56]:
## 컬럼명 확인
print(team_df.columns)
print("-----")
print(team_df.loc[:, 'toto']) # 전체행, toto팀
print("-----")
print(team_df.loc[:, ['toto', 'gildong'] ]) # 전체행, toto, gildong팀
print("-----")
print(team_df.loc[:, 'toto': ]) # 전체행, toto 부터 끝까지

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')
-----
19-05-01    1500
19-05-02    3000
19-05-03    5000
19-05-04    7000
19-05-05    5500
Name: toto, dtype: int64
-----
          toto  gildong
19-05-01  1500     2000
19-05-02  3000     2500
19-05-03  5000     3000
19-05-04  7000     4000
19-05-05  5500     3000
-----
          toto  apple  gildong
19-05-01  1500   4000     2000
19-05-02  3000   5000     2500
19-05-03  5000   6000     3000
19-05-04  7000   5500     4000
19-05-05  5500   4500     3000

In [57]:
print(team_df.iloc[0]) # 첫번째 행 접근
print("------")
print(team_df.iloc[ [0,1] ]) # 첫번째 두번째 행 접근
print("------")
print(team_df.iloc[ 0:3:1] ) # 첫번째부터 세번째 행 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[ range_num ] ) # 첫번째부터 세번째 행 접근

catanddog    7000
toto         1500
apple        4000
gildong      2000
Name: 19-05-01, dtype: int64
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
------
          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000

In [58]:
print(team_df.iloc[:, 0]) # 첫번째 열 접근
print("------")
print(team_df.iloc[:, [0,1] ]) # 첫번째 두번째 열 접근
print("------")
print(team_df.iloc[:, 0:3:1] ) # 첫번째부터 세번째 열 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[:, range_num ] ) # 첫번째부터 세번째 열 접근

19-05-01    7000
19-05-02    5000
19-05-03    3000
19-05-04    5000
19-05-05    4000
Name: catanddog, dtype: int64
------
          catanddog  toto
19-05-01       7000  1500
19-05-02       5000  3000
19-05-03       3000  5000
19-05-04       5000  7000
19-05-05       4000  5500
------
          catanddog  toto  apple
19-05-01       7000  1500   4000
19-05-02       5000  3000   5000
19-05-03       3000  5000   6000
19-05-04       5000  7000   5500
19-05-05       4000  5500   4500
------
          catanddog  toto  apple
19-05-01       7000  1500   4000
19-05-02       5000  3000   5000
19-05-03       3000  5000   6000
19-05-04       5000  7000   5500
19-05-05       4000  5500   4500

In [59]:
print(team_df.sum() )  # 열의 합계
print("----")
print(team_df.mean() ) # 열의 평균
print("----")

catanddog    24000
toto         22000
apple        25000
gildong      14500
dtype: int64
----
catanddog    4800.0
toto         4400.0
apple        5000.0
gildong      2900.0
dtype: float64
----

In [60]:
team_df

          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
19-05-04       5000  7000   5500     4000
19-05-05       4000  5500   4500     3000

In [61]:
team_df["rowsum"] = team_df.sum(axis=1)
team_df

          catanddog  toto  apple  gildong  rowsum
19-05-01       7000  1500   4000     2000   14500
19-05-02       5000  3000   5000     2500   15500
19-05-03       3000  5000   6000     3000   17000
19-05-04       5000  7000   5500     4000   21500
19-05-05       4000  5500   4500     3000   17000

In [65]:
team_df['rowsum'].sort_values(ascending=False)

19-05-04    21500
19-05-05    17000
19-05-03    17000
19-05-02    15500
19-05-01    14500
Name: rowsum, dtype: int64

In [66]:
team_score = {
              "현재가":[993,9490,9990,4500],
              "전일비":[229,2190,2300,635],
              "등락률":[27,30,29,14],
              "거래량":[4600,1900,3157,7231],}
team_df = DataFrame(team_score)
team_df

    현재가   전일비  등락률   거래량
0   993   229   27  4600
1  9490  2190   30  1900
2  9990  2300   29  3157
3  4500   635   14  7231

In [68]:
date = ['솔고바이오','한세엠케이', '네오오토', '엄지하우스']
team_df = DataFrame(team_score,
                   columns=['현재가', '전일비', '등락률', '거래량'],
                   index=date)
team_df

        현재가   전일비  등락률   거래량
솔고바이오   993   229   27  4600
한세엠케이  9490  2190   30  1900
네오오토   9990  2300   29  3157
엄지하우스  4500   635   14  7231

In [72]:
team_df.loc[['한세엠케이','네오오토']]

        현재가   전일비  등락률   거래량
한세엠케이  9490  2190   30  1900
네오오토   9990  2300   29  3157

In [73]:
team_df.loc['엄지하우스']

현재가    4500
전일비     635
등락률      14
거래량    7231
Name: 엄지하우스, dtype: int64

In [74]:
team_df.loc[['한세엠케이','네오오토'],['전일비','등락률']]

        전일비  등락률
한세엠케이  2190   30
네오오토   2300   29